app/controllers/players_controller.rb

SELECT  `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1
---
  def show
  	@player = Player.find(params[:id])

SELECT  `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1
---
  def edit
    @player = Player.find(params[:id])

SELECT  `players`.* FROM `players` WHERE `players`.`id` = 3 LIMIT 1
---
  def delete
    @player = Player.find(params[:id])

DELETE FROM `players` WHERE `players`.`id` = 3
SELECT  `players`.* FROM `players` WHERE `players`.`id` = 3 LIMIT 1
---
  def destroy
    @player = Player.find(params[:id]).destroy

INSERT INTO `players` (`name`, `created_at`, `updated_at`) VALUES ('Diego Umejuarez', '2015-05-05 02:47:26.678436', '2015-05-05 02:47:26.678436')
---
  def create
    # Instantiate a new object using form parameters
    @player = Player.new(player_params)
    # Save the object
    if @player.save

SELECT  `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1
UPDATE `players` SET `name` = 'Mashes Hardest', `points` = 120, `ranking` = 2, `updated_at` = '2015-05-18 18:53:17.899339' WHERE `players`.`id` = 2
---
  def update
    # Find an existing object using form parameters
    @player = Player.find(params[:id])
    # Update the object
    if @player.update_attributes(player_params)