app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('Default', '2015-05-14 02:52:13.238387', '2015-05-14 02:52:13.238387')
---
  def create
  	@user = User.new(user_params)
  	if @user.save